/* создание полнотекстового индекса для полей Наименование и Описание */
alter table products
add fulltext (name, note);

/* выборка из таблицы Товары всех записей, где есть вхождение словосочетания "коврик тефлон" в полях Наименование, Описание */
select name, note 
from products
where match(name, note) 
against('коврик тефлон');

/* выборка из таблицы Товары всех записей, где есть вхождение "кольцо" и нет вхождения "разъемное" в полях Наименование, Описание */
select name, note 
from products
where match(name, note)
against('+кольцо -разъемное' in boolean mode);

/* информация о поиске с индексом */
explain select name, note 
from products
where match(name, note) 
against('коврик силикон');

+----+-------------+----------+------------+----------+---------------+------+---------+-------+------+----------+-------------------------------+
| id | select_type | table    | partitions | type     | possible_keys | key  | key_len | ref   | rows | filtered | Extra                         |
+----+-------------+----------+------------+----------+---------------+------+---------+-------+------+----------+-------------------------------+
|  1 | SIMPLE      | products | NULL       | fulltext | name          | name | 0       | const |    1 |   100.00 | Using where; Ft_hints: sorted |
+----+-------------+----------+------------+----------+---------------+------+---------+-------+------+----------+-------------------------------+
1 row in set, 1 warning (0.00 sec)

/* информация о поиске без индекса */
explain select name, note 
from products
ignore index(name)
where match(name, note) 
against('коврик силикон');

+----+-------------+----------+------------+------+---------------+------+---------+------+------+----------+-------------+
| id | select_type | table    | partitions | type | possible_keys | key  | key_len | ref  | rows | filtered | Extra       |
+----+-------------+----------+------------+------+---------------+------+---------+------+------+----------+-------------+
|  1 | SIMPLE      | products | NULL       | ALL  | NULL          | NULL | NULL    | NULL |   12 |    11.11 | Using where |
+----+-------------+----------+------------+------+---------------+------+---------+------+------+----------+-------------+
1 row in set, 1 warning (0.01 sec)
